// src/utils/dariLocale.ts
export const dariLocale = {
  name: "dari",
  months: [
    ["حمل", "حم"],
    ["ثور", "ثو"], 
    ["جوزا", "جو"],
    ["سرطان", "سر"],
    ["اسد", "اس"],
    ["سنبله", "سن"],
    ["میزان", "می"],
    ["عقرب", "عق"],
    ["قوس", "قو"],
    ["جدی", "جد"],
    ["دلو", "دل"],
    ["حوت", "حو"]
  ],
  weekDays: [
    ["شنبه", "ش"],
    ["یکشنبه", "ی"],
    ["دوشنبه", "د"],
    ["سه شنبه", "س"],
    ["چهارشنبه", "چ"],
    ["پنجشنبه", "پ"],
    ["جمعه", "ج"]
  ],
  digits: ["۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹"],
  meridiems: [
    ["قبل از ظهر", "ق.ظ"],
    ["بعد از ظهر", "ب.ظ"]
  ]
}